zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_ETPU.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2022 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K39_ETPU.h
 * @version 1.7
 * @date 2022-11-18
 * @brief Peripheral Access Layer for S32K39_ETPU
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K39_ETPU_H_)  /* Check if memory map has not been already included */
#define S32K39_ETPU_H_

#include "S32K39_COMMON.h"

/* ----------------------------------------------------------------------------
   -- ETPU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ETPU_Peripheral_Access_Layer ETPU Peripheral Access Layer
 * @{
 */

/** ETPU - Size of Registers Arrays */
#define ETPU_CCR_ENG1_COUNT                       32u
#define ETPU_CCR_ENG2_COUNT                       32u

/** ETPU - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< eTPU Module Configuration Register, offset: 0x0 */
  __IO uint32_t CDCR;                              /**< eTPU Coherent Dual-Parameter Controller Register, offset: 0x4 */
  uint8_t RESERVED_0[4];
  __IO uint32_t MISCCMPR;                          /**< eTPU MISC Compare Register, offset: 0xC */
  __IO uint32_t SCMOFFDATAR;                       /**< eTPU SCM Off-range Data Register, offset: 0x10 */
  __IO uint32_t ECR_ENG1;                          /**< eTPU Engine 1 Configuration Register, offset: 0x14 */
  __IO uint32_t ECR_ENG2;                          /**< eTPU Engine 2 Configuration Register, offset: 0x18 */
  uint8_t RESERVED_1[4];
  __IO uint32_t TBCR_ENG1;                         /**< eTPU Engine 1 Time Base Configuration Register, offset: 0x20 */
  __I  uint32_t TB1R_ENG1;                         /**< eTPU Engine 1 Time Base 1 (TCR1) Visibility Register, offset: 0x24 */
  __I  uint32_t TB2R_ENG1;                         /**< eTPU Engine 1 Time Base 2 (TCR2) Visibility Register, offset: 0x28 */
  __IO uint32_t STAC_ENG1;                         /**< eTPU Engine 1 STAC Configuration Register, offset: 0x2C */
  uint8_t RESERVED_2[16];
  __IO uint32_t TBCR_ENG2;                         /**< eTPU Engine 2 Time Base Configuration Register, offset: 0x40 */
  __I  uint32_t TB1R_ENG2;                         /**< eTPU Engine 2 Time Base 1 (TCR1) Visibility Register, offset: 0x44 */
  __I  uint32_t TB2R_ENG2;                         /**< eTPU Engine 2 Time Base 2 (TCR2) Visibility Register, offset: 0x48 */
  __IO uint32_t STAC_ENG2;                         /**< eTPU Engine 2 STAC Configuration Register, offset: 0x4C */
  uint8_t RESERVED_3[16];
  __IO uint32_t WDTR_ENG1;                         /**< eTPU Watchdog Timer Register for Engine 1, offset: 0x60 */
  uint8_t RESERVED_4[4];
  __IO uint32_t IDLER_ENG1;                        /**< eTPU Idle Register for Engine 1, offset: 0x68 */
  uint8_t RESERVED_5[4];
  __IO uint32_t WDTR_ENG2;                         /**< eTPU Watchdog Timer Register for Engine 2, offset: 0x70 */
  uint8_t RESERVED_6[4];
  __IO uint32_t IDLER_ENG2;                        /**< eTPU Idle Register for Engine 2, offset: 0x78 */
  uint8_t RESERVED_7[132];
  __IO uint32_t MECR;                              /**< eTPU Memory Error Control Register, offset: 0x100 */
  __IO uint32_t DEIAR;                             /**< eTPU Data Error Injection Address Register, offset: 0x104 */
  __IO uint32_t DEIDPR;                            /**< eTPU Data Error Injection Data Pattern Register, offset: 0x108 */
  __IO uint32_t DEIPPR;                            /**< eTPU Data Error Injection Parity Pattern Register, offset: 0x10C */
  __I  uint32_t DERAR;                             /**< eTPU Data Error Report Address Register, offset: 0x110 */
  __I  uint32_t DERDR;                             /**< eTPU Data Error Report Data Register, offset: 0x114 */
  __I  uint32_t DERSR;                             /**< eTPU Data Error Report Syndrome Register, offset: 0x118 */
  uint8_t RESERVED_8[4];
  __IO uint32_t MESR;                              /**< eTPU Memory Error Status Register, offset: 0x120 */
  __IO uint32_t CEIAR;                             /**< eTPU Code Error Injection Address Register, offset: 0x124 */
  __IO uint32_t CEIDPR;                            /**< eTPU Code Error Injection Data Pattern Register, offset: 0x128 */
  __IO uint32_t CEIPPR;                            /**< eTPU Code Error Injection Parity Pattern Register, offset: 0x12C */
  __I  uint32_t CERAR;                             /**< eTPU Code Error Report Address Register, offset: 0x130 */
  __I  uint32_t CERDR;                             /**< eTPU Code Error Report Data Register, offset: 0x134 */
  __I  uint32_t CERSR;                             /**< eTPU Code Error Report Syndrome Register, offset: 0x138 */
  __IO uint32_t CEFR;                              /**< eTPU Code Error Fix Register, offset: 0x13C */
  uint8_t RESERVED_9[192];
  __IO uint32_t CISR_ENG1;                         /**< eTPU Channel Interrupt Status Register for Engine 1, offset: 0x200 */
  __IO uint32_t CISR_ENG2;                         /**< eTPU Channel Interrupt Status Register for Engine 2, offset: 0x204 */
  uint8_t RESERVED_10[8];
  __IO uint32_t CDTRSR_ENG1;                       /**< eTPU Channel Data Transfer Request Status Register for Engine 1, offset: 0x210 */
  __IO uint32_t CDTRSR_ENG2;                       /**< eTPU Channel Data Transfer Request Status Register for Engine 2, offset: 0x214 */
  uint8_t RESERVED_11[8];
  __IO uint32_t CIOSR_ENG1;                        /**< eTPU Channel Interrupt Overflow Status Register for Engine 1, offset: 0x220 */
  __IO uint32_t CIOSR_ENG2;                        /**< eTPU Channel Interrupt Overflow Status Register for Engine 2, offset: 0x224 */
  uint8_t RESERVED_12[8];
  __IO uint32_t CDTROSR_ENG1;                      /**< eTPU Channel Data Transfer Request Overflow Status Register for Engine 1, offset: 0x230 */
  __IO uint32_t CDTROSR_ENG2;                      /**< eTPU Channel Data Transfer Request Overflow Status Register for Engine 2, offset: 0x234 */
  uint8_t RESERVED_13[8];
  __IO uint32_t CIER_ENG1;                         /**< eTPU Channel Interrupt Enable Register for Engine 1, offset: 0x240 */
  __IO uint32_t CIER_ENG2;                         /**< eTPU Channel Interrupt Enable Register for Engine 2, offset: 0x244 */
  uint8_t RESERVED_14[8];
  __IO uint32_t CDTRER_ENG1;                       /**< eTPU Channel Data Transfer Request Enable Register for Engine 1, offset: 0x250 */
  __IO uint32_t CDTRER_ENG2;                       /**< eTPU Channel Data Transfer Request Enable Register for Engine 2, offset: 0x254 */
  uint8_t RESERVED_15[8];
  __IO uint32_t WDSR_ENG1;                         /**< eTPU Watchdog Status Register for Engine 1, offset: 0x260 */
  __IO uint32_t WDSR_ENG2;                         /**< eTPU Watchdog Status Register for Engine 2, offset: 0x264 */
  uint8_t RESERVED_16[24];
  __I  uint32_t CPSSR_ENG1;                        /**< eTPU Channel Pending Service Status Register for Engine 1, offset: 0x280 */
  __I  uint32_t CPSSR_ENG2;                        /**< eTPU Channel Pending Service Status Register for Engine 2, offset: 0x284 */
  uint8_t RESERVED_17[8];
  __I  uint32_t CSSR_ENG1;                         /**< eTPU Channel Service Status Register for Engine 1, offset: 0x290 */
  __I  uint32_t CSSR_ENG2;                         /**< eTPU Channel Service Status Register for Engine 2, offset: 0x294 */
  uint8_t RESERVED_18[360];
  struct {                                         /* offset: 0x400, array step: 0x10 */
    __IO uint32_t CCR_ENG1;                          /**< eTPU Channel n Configuration Register for Engine 1, array offset: 0x400, array step: 0x10 */
    __IO uint32_t CSCR_ENG1;                         /**< eTPU Channel n Status Control Register for Engine 1, array offset: 0x404, array step: 0x10 */
    __IO uint32_t CHSRR_ENG1;                        /**< eTPU Channel n Host Service Request Register for Engine 1, array offset: 0x408, array step: 0x10 */
    uint8_t RESERVED_0[4];
  } CCR_ENG1[ETPU_CCR_ENG1_COUNT];
  uint8_t RESERVED_19[512];
  struct {                                         /* offset: 0x800, array step: 0x10 */
    __IO uint32_t CCR_ENG2;                          /**< eTPU Channel n Configuration Register for Engine 2, array offset: 0x800, array step: 0x10 */
    __IO uint32_t CSCR_ENG2;                         /**< eTPU Channel n Status Control Register for Engine 2, array offset: 0x804, array step: 0x10 */
    __IO uint32_t CHSRR_ENG2;                        /**< eTPU Channel n Host Service Request Register for Engine 2, array offset: 0x808, array step: 0x10 */
    uint8_t RESERVED_0[4];
  } CCR_ENG2[ETPU_CCR_ENG2_COUNT];
} ETPU_Type, *ETPU_MemMapPtr;

/** Number of instances of the ETPU module. */
#define ETPU_INSTANCE_COUNT                      (6u)

/* ETPU - Peripheral instance base addresses */
/** Peripheral ETPU_0 base address */
#define IP_ETPU_0_BASE                           (0x40680000u)
/** Peripheral ETPU_0 base pointer */
#define IP_ETPU_0                                ((ETPU_Type *)IP_ETPU_0_BASE)
/** Peripheral ETPU_1 base address */
#define IP_ETPU_1_BASE                           (0x40680000u)
/** Peripheral ETPU_1 base pointer */
#define IP_ETPU_1                                ((ETPU_Type *)IP_ETPU_1_BASE)
/** Peripheral ETPU_2 base address */
#define IP_ETPU_2_BASE                           (0x40680000u)
/** Peripheral ETPU_2 base pointer */
#define IP_ETPU_2                                ((ETPU_Type *)IP_ETPU_2_BASE)
/** Peripheral ETPU_3 base address */
#define IP_ETPU_3_BASE                           (0x40680000u)
/** Peripheral ETPU_3 base pointer */
#define IP_ETPU_3                                ((ETPU_Type *)IP_ETPU_3_BASE)
/** Peripheral ETPU_4 base address */
#define IP_ETPU_4_BASE                           (0x40680000u)
/** Peripheral ETPU_4 base pointer */
#define IP_ETPU_4                                ((ETPU_Type *)IP_ETPU_4_BASE)
/** Peripheral ETPU_6 base address */
#define IP_ETPU_6_BASE                           (0x40680000u)
/** Peripheral ETPU_6 base pointer */
#define IP_ETPU_6                                ((ETPU_Type *)IP_ETPU_6_BASE)
/** Array initializer of ETPU peripheral base addresses */
#define IP_ETPU_BASE_ADDRS                       { IP_ETPU_0_BASE, IP_ETPU_1_BASE, IP_ETPU_2_BASE, IP_ETPU_3_BASE, IP_ETPU_4_BASE, IP_ETPU_6_BASE }
/** Array initializer of ETPU peripheral base pointers */
#define IP_ETPU_BASE_PTRS                        { IP_ETPU_0, IP_ETPU_1, IP_ETPU_2, IP_ETPU_3, IP_ETPU_4, IP_ETPU_6 }

/* ----------------------------------------------------------------------------
   -- ETPU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ETPU_Register_Masks ETPU Register Masks
 * @{
 */

/*! @name MCR - eTPU Module Configuration Register */
/*! @{ */

#define ETPU_MCR_GTBE_MASK                       (0x1U)
#define ETPU_MCR_GTBE_SHIFT                      (0U)
#define ETPU_MCR_GTBE_WIDTH                      (1U)
#define ETPU_MCR_GTBE(x)                         (((uint32_t)(((uint32_t)(x)) << ETPU_MCR_GTBE_SHIFT)) & ETPU_MCR_GTBE_MASK)

#define ETPU_MCR_VIS_MASK                        (0x40U)
#define ETPU_MCR_VIS_SHIFT                       (6U)
#define ETPU_MCR_VIS_WIDTH                       (1U)
#define ETPU_MCR_VIS(x)                          (((uint32_t)(((uint32_t)(x)) << ETPU_MCR_VIS_SHIFT)) & ETPU_MCR_VIS_MASK)

