zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_ETPU.h
#define ETPU_MCR_SCMERR_MASK                     (0x100U)
#define ETPU_MCR_SCMERR_SHIFT                    (8U)
#define ETPU_MCR_SCMERR_WIDTH                    (1U)
#define ETPU_MCR_SCMERR(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_MCR_SCMERR_SHIFT)) & ETPU_MCR_SCMERR_MASK)

#define ETPU_MCR_SCMMISEN_MASK                   (0x200U)
#define ETPU_MCR_SCMMISEN_SHIFT                  (9U)
#define ETPU_MCR_SCMMISEN_WIDTH                  (1U)
#define ETPU_MCR_SCMMISEN(x)                     (((uint32_t)(((uint32_t)(x)) << ETPU_MCR_SCMMISEN_SHIFT)) & ETPU_MCR_SCMMISEN_MASK)

#define ETPU_MCR_SCMMISF_MASK                    (0x400U)
#define ETPU_MCR_SCMMISF_SHIFT                   (10U)
#define ETPU_MCR_SCMMISF_WIDTH                   (1U)
#define ETPU_MCR_SCMMISF(x)                      (((uint32_t)(((uint32_t)(x)) << ETPU_MCR_SCMMISF_SHIFT)) & ETPU_MCR_SCMMISF_MASK)

#define ETPU_MCR_SCMMISC_MASK                    (0x800U)
#define ETPU_MCR_SCMMISC_SHIFT                   (11U)
#define ETPU_MCR_SCMMISC_WIDTH                   (1U)
#define ETPU_MCR_SCMMISC(x)                      (((uint32_t)(((uint32_t)(x)) << ETPU_MCR_SCMMISC_SHIFT)) & ETPU_MCR_SCMMISC_MASK)

#define ETPU_MCR_SCMSIZE_MASK                    (0x1F0000U)
#define ETPU_MCR_SCMSIZE_SHIFT                   (16U)
#define ETPU_MCR_SCMSIZE_WIDTH                   (5U)
#define ETPU_MCR_SCMSIZE(x)                      (((uint32_t)(((uint32_t)(x)) << ETPU_MCR_SCMSIZE_SHIFT)) & ETPU_MCR_SCMSIZE_MASK)

#define ETPU_MCR_SSAERR_MASK                     (0x800000U)
#define ETPU_MCR_SSAERR_SHIFT                    (23U)
#define ETPU_MCR_SSAERR_WIDTH                    (1U)
#define ETPU_MCR_SSAERR(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_MCR_SSAERR_SHIFT)) & ETPU_MCR_SSAERR_MASK)

#define ETPU_MCR_ILF2_MASK                       (0x1000000U)
#define ETPU_MCR_ILF2_SHIFT                      (24U)
#define ETPU_MCR_ILF2_WIDTH                      (1U)
#define ETPU_MCR_ILF2(x)                         (((uint32_t)(((uint32_t)(x)) << ETPU_MCR_ILF2_SHIFT)) & ETPU_MCR_ILF2_MASK)

#define ETPU_MCR_ILF1_MASK                       (0x2000000U)
#define ETPU_MCR_ILF1_SHIFT                      (25U)
#define ETPU_MCR_ILF1_WIDTH                      (1U)
#define ETPU_MCR_ILF1(x)                         (((uint32_t)(((uint32_t)(x)) << ETPU_MCR_ILF1_SHIFT)) & ETPU_MCR_ILF1_MASK)

#define ETPU_MCR_MGE2_MASK                       (0x4000000U)
#define ETPU_MCR_MGE2_SHIFT                      (26U)
#define ETPU_MCR_MGE2_WIDTH                      (1U)
#define ETPU_MCR_MGE2(x)                         (((uint32_t)(((uint32_t)(x)) << ETPU_MCR_MGE2_SHIFT)) & ETPU_MCR_MGE2_MASK)

#define ETPU_MCR_MGE1_MASK                       (0x8000000U)
#define ETPU_MCR_MGE1_SHIFT                      (27U)
#define ETPU_MCR_MGE1_WIDTH                      (1U)
#define ETPU_MCR_MGE1(x)                         (((uint32_t)(((uint32_t)(x)) << ETPU_MCR_MGE1_SHIFT)) & ETPU_MCR_MGE1_MASK)

#define ETPU_MCR_WDTO2_MASK                      (0x10000000U)
#define ETPU_MCR_WDTO2_SHIFT                     (28U)
#define ETPU_MCR_WDTO2_WIDTH                     (1U)
#define ETPU_MCR_WDTO2(x)                        (((uint32_t)(((uint32_t)(x)) << ETPU_MCR_WDTO2_SHIFT)) & ETPU_MCR_WDTO2_MASK)

#define ETPU_MCR_WDTO1_MASK                      (0x20000000U)
#define ETPU_MCR_WDTO1_SHIFT                     (29U)
#define ETPU_MCR_WDTO1_WIDTH                     (1U)
#define ETPU_MCR_WDTO1(x)                        (((uint32_t)(((uint32_t)(x)) << ETPU_MCR_WDTO1_SHIFT)) & ETPU_MCR_WDTO1_MASK)

#define ETPU_MCR_SDMERR_MASK                     (0x40000000U)
#define ETPU_MCR_SDMERR_SHIFT                    (30U)
#define ETPU_MCR_SDMERR_WIDTH                    (1U)
#define ETPU_MCR_SDMERR(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_MCR_SDMERR_SHIFT)) & ETPU_MCR_SDMERR_MASK)

#define ETPU_MCR_GEC_MASK                        (0x80000000U)
#define ETPU_MCR_GEC_SHIFT                       (31U)
#define ETPU_MCR_GEC_WIDTH                       (1U)
#define ETPU_MCR_GEC(x)                          (((uint32_t)(((uint32_t)(x)) << ETPU_MCR_GEC_SHIFT)) & ETPU_MCR_GEC_MASK)
/*! @} */

/*! @name CDCR - eTPU Coherent Dual-Parameter Controller Register */
/*! @{ */

#define ETPU_CDCR_PARM1_MASK                     (0x7FU)
#define ETPU_CDCR_PARM1_SHIFT                    (0U)
#define ETPU_CDCR_PARM1_WIDTH                    (7U)
#define ETPU_CDCR_PARM1(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_CDCR_PARM1_SHIFT)) & ETPU_CDCR_PARM1_MASK)

#define ETPU_CDCR_WR_MASK                        (0x80U)
#define ETPU_CDCR_WR_SHIFT                       (7U)
#define ETPU_CDCR_WR_WIDTH                       (1U)
#define ETPU_CDCR_WR(x)                          (((uint32_t)(((uint32_t)(x)) << ETPU_CDCR_WR_SHIFT)) & ETPU_CDCR_WR_MASK)

#define ETPU_CDCR_PARM0_MASK                     (0x7F00U)
#define ETPU_CDCR_PARM0_SHIFT                    (8U)
#define ETPU_CDCR_PARM0_WIDTH                    (7U)
#define ETPU_CDCR_PARM0(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_CDCR_PARM0_SHIFT)) & ETPU_CDCR_PARM0_MASK)

#define ETPU_CDCR_PWIDTH_MASK                    (0x8000U)
#define ETPU_CDCR_PWIDTH_SHIFT                   (15U)
#define ETPU_CDCR_PWIDTH_WIDTH                   (1U)
#define ETPU_CDCR_PWIDTH(x)                      (((uint32_t)(((uint32_t)(x)) << ETPU_CDCR_PWIDTH_SHIFT)) & ETPU_CDCR_PWIDTH_MASK)

#define ETPU_CDCR_PBBASE_MASK                    (0x3FF0000U)
#define ETPU_CDCR_PBBASE_SHIFT                   (16U)
#define ETPU_CDCR_PBBASE_WIDTH                   (10U)
#define ETPU_CDCR_PBBASE(x)                      (((uint32_t)(((uint32_t)(x)) << ETPU_CDCR_PBBASE_SHIFT)) & ETPU_CDCR_PBBASE_MASK)

#define ETPU_CDCR_CTBASE_MASK                    (0x7C000000U)
#define ETPU_CDCR_CTBASE_SHIFT                   (26U)
#define ETPU_CDCR_CTBASE_WIDTH                   (5U)
#define ETPU_CDCR_CTBASE(x)                      (((uint32_t)(((uint32_t)(x)) << ETPU_CDCR_CTBASE_SHIFT)) & ETPU_CDCR_CTBASE_MASK)

