zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_ETPU.h
#define ETPU_CDCR_STS_MASK                       (0x80000000U)
#define ETPU_CDCR_STS_SHIFT                      (31U)
#define ETPU_CDCR_STS_WIDTH                      (1U)
#define ETPU_CDCR_STS(x)                         (((uint32_t)(((uint32_t)(x)) << ETPU_CDCR_STS_SHIFT)) & ETPU_CDCR_STS_MASK)
/*! @} */

/*! @name MISCCMPR - eTPU MISC Compare Register */
/*! @{ */

#define ETPU_MISCCMPR_ETPUMISCCMP_MASK           (0xFFFFFFFFU)
#define ETPU_MISCCMPR_ETPUMISCCMP_SHIFT          (0U)
#define ETPU_MISCCMPR_ETPUMISCCMP_WIDTH          (32U)
#define ETPU_MISCCMPR_ETPUMISCCMP(x)             (((uint32_t)(((uint32_t)(x)) << ETPU_MISCCMPR_ETPUMISCCMP_SHIFT)) & ETPU_MISCCMPR_ETPUMISCCMP_MASK)
/*! @} */

/*! @name SCMOFFDATAR - eTPU SCM Off-range Data Register */
/*! @{ */

#define ETPU_SCMOFFDATAR_ETPUSCMOFFDATAR_MASK    (0xFFFFFFFFU)
#define ETPU_SCMOFFDATAR_ETPUSCMOFFDATAR_SHIFT   (0U)
#define ETPU_SCMOFFDATAR_ETPUSCMOFFDATAR_WIDTH   (32U)
#define ETPU_SCMOFFDATAR_ETPUSCMOFFDATAR(x)      (((uint32_t)(((uint32_t)(x)) << ETPU_SCMOFFDATAR_ETPUSCMOFFDATAR_SHIFT)) & ETPU_SCMOFFDATAR_ETPUSCMOFFDATAR_MASK)
/*! @} */

/*! @name ECR_ENG1 - eTPU Engine 1 Configuration Register */
/*! @{ */

#define ETPU_ECR_ENG1_ETB_MASK                   (0x1FU)
#define ETPU_ECR_ENG1_ETB_SHIFT                  (0U)
#define ETPU_ECR_ENG1_ETB_WIDTH                  (5U)
#define ETPU_ECR_ENG1_ETB(x)                     (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG1_ETB_SHIFT)) & ETPU_ECR_ENG1_ETB_MASK)

#define ETPU_ECR_ENG1_SPPDIS_MASK                (0x80U)
#define ETPU_ECR_ENG1_SPPDIS_SHIFT               (7U)
#define ETPU_ECR_ENG1_SPPDIS_WIDTH               (1U)
#define ETPU_ECR_ENG1_SPPDIS(x)                  (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG1_SPPDIS_SHIFT)) & ETPU_ECR_ENG1_SPPDIS_MASK)

#define ETPU_ECR_ENG1_ERBA_MASK                  (0x1F00U)
#define ETPU_ECR_ENG1_ERBA_SHIFT                 (8U)
#define ETPU_ECR_ENG1_ERBA_WIDTH                 (5U)
#define ETPU_ECR_ENG1_ERBA(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG1_ERBA_SHIFT)) & ETPU_ECR_ENG1_ERBA_MASK)

#define ETPU_ECR_ENG1_CDFC_MASK                  (0xC000U)
#define ETPU_ECR_ENG1_CDFC_SHIFT                 (14U)
#define ETPU_ECR_ENG1_CDFC_WIDTH                 (2U)
#define ETPU_ECR_ENG1_CDFC(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG1_CDFC_SHIFT)) & ETPU_ECR_ENG1_CDFC_MASK)

#define ETPU_ECR_ENG1_FPSCK_MASK                 (0x70000U)
#define ETPU_ECR_ENG1_FPSCK_SHIFT                (16U)
#define ETPU_ECR_ENG1_FPSCK_WIDTH                (3U)
#define ETPU_ECR_ENG1_FPSCK(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG1_FPSCK_SHIFT)) & ETPU_ECR_ENG1_FPSCK_MASK)

#define ETPU_ECR_ENG1_FCSS_MASK                  (0x80000U)
#define ETPU_ECR_ENG1_FCSS_SHIFT                 (19U)
#define ETPU_ECR_ENG1_FCSS_WIDTH                 (1U)
#define ETPU_ECR_ENG1_FCSS(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG1_FCSS_SHIFT)) & ETPU_ECR_ENG1_FCSS_MASK)

#define ETPU_ECR_ENG1_HLTF_MASK                  (0x800000U)
#define ETPU_ECR_ENG1_HLTF_SHIFT                 (23U)
#define ETPU_ECR_ENG1_HLTF_WIDTH                 (1U)
#define ETPU_ECR_ENG1_HLTF(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG1_HLTF_SHIFT)) & ETPU_ECR_ENG1_HLTF_MASK)

#define ETPU_ECR_ENG1_STF_MASK                   (0x10000000U)
#define ETPU_ECR_ENG1_STF_SHIFT                  (28U)
#define ETPU_ECR_ENG1_STF_WIDTH                  (1U)
#define ETPU_ECR_ENG1_STF(x)                     (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG1_STF_SHIFT)) & ETPU_ECR_ENG1_STF_MASK)

#define ETPU_ECR_ENG1_MDIS_MASK                  (0x40000000U)
#define ETPU_ECR_ENG1_MDIS_SHIFT                 (30U)
#define ETPU_ECR_ENG1_MDIS_WIDTH                 (1U)
#define ETPU_ECR_ENG1_MDIS(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG1_MDIS_SHIFT)) & ETPU_ECR_ENG1_MDIS_MASK)

#define ETPU_ECR_ENG1_FEND_MASK                  (0x80000000U)
#define ETPU_ECR_ENG1_FEND_SHIFT                 (31U)
#define ETPU_ECR_ENG1_FEND_WIDTH                 (1U)
#define ETPU_ECR_ENG1_FEND(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG1_FEND_SHIFT)) & ETPU_ECR_ENG1_FEND_MASK)
/*! @} */

/*! @name ECR_ENG2 - eTPU Engine 2 Configuration Register */
/*! @{ */

#define ETPU_ECR_ENG2_ETB_MASK                   (0x1FU)
#define ETPU_ECR_ENG2_ETB_SHIFT                  (0U)
#define ETPU_ECR_ENG2_ETB_WIDTH                  (5U)
#define ETPU_ECR_ENG2_ETB(x)                     (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG2_ETB_SHIFT)) & ETPU_ECR_ENG2_ETB_MASK)

#define ETPU_ECR_ENG2_SPPDIS_MASK                (0x80U)
#define ETPU_ECR_ENG2_SPPDIS_SHIFT               (7U)
#define ETPU_ECR_ENG2_SPPDIS_WIDTH               (1U)
#define ETPU_ECR_ENG2_SPPDIS(x)                  (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG2_SPPDIS_SHIFT)) & ETPU_ECR_ENG2_SPPDIS_MASK)

#define ETPU_ECR_ENG2_ERBA_MASK                  (0x1F00U)
#define ETPU_ECR_ENG2_ERBA_SHIFT                 (8U)
#define ETPU_ECR_ENG2_ERBA_WIDTH                 (5U)
#define ETPU_ECR_ENG2_ERBA(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG2_ERBA_SHIFT)) & ETPU_ECR_ENG2_ERBA_MASK)

#define ETPU_ECR_ENG2_CDFC_MASK                  (0xC000U)
#define ETPU_ECR_ENG2_CDFC_SHIFT                 (14U)
#define ETPU_ECR_ENG2_CDFC_WIDTH                 (2U)
#define ETPU_ECR_ENG2_CDFC(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG2_CDFC_SHIFT)) & ETPU_ECR_ENG2_CDFC_MASK)

#define ETPU_ECR_ENG2_FPSCK_MASK                 (0x70000U)
#define ETPU_ECR_ENG2_FPSCK_SHIFT                (16U)
#define ETPU_ECR_ENG2_FPSCK_WIDTH                (3U)
#define ETPU_ECR_ENG2_FPSCK(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG2_FPSCK_SHIFT)) & ETPU_ECR_ENG2_FPSCK_MASK)

#define ETPU_ECR_ENG2_FCSS_MASK                  (0x80000U)
#define ETPU_ECR_ENG2_FCSS_SHIFT                 (19U)
#define ETPU_ECR_ENG2_FCSS_WIDTH                 (1U)
#define ETPU_ECR_ENG2_FCSS(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG2_FCSS_SHIFT)) & ETPU_ECR_ENG2_FCSS_MASK)

#define ETPU_ECR_ENG2_HLTF_MASK                  (0x800000U)
#define ETPU_ECR_ENG2_HLTF_SHIFT                 (23U)
#define ETPU_ECR_ENG2_HLTF_WIDTH                 (1U)
#define ETPU_ECR_ENG2_HLTF(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG2_HLTF_SHIFT)) & ETPU_ECR_ENG2_HLTF_MASK)

#define ETPU_ECR_ENG2_STF_MASK                   (0x10000000U)
#define ETPU_ECR_ENG2_STF_SHIFT                  (28U)
#define ETPU_ECR_ENG2_STF_WIDTH                  (1U)
#define ETPU_ECR_ENG2_STF(x)                     (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG2_STF_SHIFT)) & ETPU_ECR_ENG2_STF_MASK)

#define ETPU_ECR_ENG2_MDIS_MASK                  (0x40000000U)
#define ETPU_ECR_ENG2_MDIS_SHIFT                 (30U)
#define ETPU_ECR_ENG2_MDIS_WIDTH                 (1U)
#define ETPU_ECR_ENG2_MDIS(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG2_MDIS_SHIFT)) & ETPU_ECR_ENG2_MDIS_MASK)

#define ETPU_ECR_ENG2_FEND_MASK                  (0x80000000U)
#define ETPU_ECR_ENG2_FEND_SHIFT                 (31U)
#define ETPU_ECR_ENG2_FEND_WIDTH                 (1U)
#define ETPU_ECR_ENG2_FEND(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_ECR_ENG2_FEND_SHIFT)) & ETPU_ECR_ENG2_FEND_MASK)
/*! @} */

/*! @name TBCR_ENG1 - eTPU Engine 1 Time Base Configuration Register */
/*! @{ */

#define ETPU_TBCR_ENG1_TCR1P_MASK                (0xFFU)
#define ETPU_TBCR_ENG1_TCR1P_SHIFT               (0U)
#define ETPU_TBCR_ENG1_TCR1P_WIDTH               (8U)
#define ETPU_TBCR_ENG1_TCR1P(x)                  (((uint32_t)(((uint32_t)(x)) << ETPU_TBCR_ENG1_TCR1P_SHIFT)) & ETPU_TBCR_ENG1_TCR1P_MASK)

