zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_ETPU.h
#define ETPU_TBCR_ENG1_TCR1CS_MASK               (0x2000U)
#define ETPU_TBCR_ENG1_TCR1CS_SHIFT              (13U)
#define ETPU_TBCR_ENG1_TCR1CS_WIDTH              (1U)
#define ETPU_TBCR_ENG1_TCR1CS(x)                 (((uint32_t)(((uint32_t)(x)) << ETPU_TBCR_ENG1_TCR1CS_SHIFT)) & ETPU_TBCR_ENG1_TCR1CS_MASK)

#define ETPU_TBCR_ENG1_TCR1CTL_MASK              (0xC000U)
#define ETPU_TBCR_ENG1_TCR1CTL_SHIFT             (14U)
#define ETPU_TBCR_ENG1_TCR1CTL_WIDTH             (2U)
#define ETPU_TBCR_ENG1_TCR1CTL(x)                (((uint32_t)(((uint32_t)(x)) << ETPU_TBCR_ENG1_TCR1CTL_SHIFT)) & ETPU_TBCR_ENG1_TCR1CTL_MASK)

#define ETPU_TBCR_ENG1_TCR2P_MASK                (0x3F0000U)
#define ETPU_TBCR_ENG1_TCR2P_SHIFT               (16U)
#define ETPU_TBCR_ENG1_TCR2P_WIDTH               (6U)
#define ETPU_TBCR_ENG1_TCR2P(x)                  (((uint32_t)(((uint32_t)(x)) << ETPU_TBCR_ENG1_TCR2P_SHIFT)) & ETPU_TBCR_ENG1_TCR2P_MASK)

#define ETPU_TBCR_ENG1_ATGC_MASK                 (0x1000000U)
#define ETPU_TBCR_ENG1_ATGC_SHIFT                (24U)
#define ETPU_TBCR_ENG1_ATGC_WIDTH                (1U)
#define ETPU_TBCR_ENG1_ATGC(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_TBCR_ENG1_ATGC_SHIFT)) & ETPU_TBCR_ENG1_ATGC_MASK)

#define ETPU_TBCR_ENG1_AM_MASK                   (0x6000000U)
#define ETPU_TBCR_ENG1_AM_SHIFT                  (25U)
#define ETPU_TBCR_ENG1_AM_WIDTH                  (2U)
#define ETPU_TBCR_ENG1_AM(x)                     (((uint32_t)(((uint32_t)(x)) << ETPU_TBCR_ENG1_AM_SHIFT)) & ETPU_TBCR_ENG1_AM_MASK)

#define ETPU_TBCR_ENG1_TCRCF_MASK                (0x18000000U)
#define ETPU_TBCR_ENG1_TCRCF_SHIFT               (27U)
#define ETPU_TBCR_ENG1_TCRCF_WIDTH               (2U)
#define ETPU_TBCR_ENG1_TCRCF(x)                  (((uint32_t)(((uint32_t)(x)) << ETPU_TBCR_ENG1_TCRCF_SHIFT)) & ETPU_TBCR_ENG1_TCRCF_MASK)

#define ETPU_TBCR_ENG1_TCR2CTL_MASK              (0xE0000000U)
#define ETPU_TBCR_ENG1_TCR2CTL_SHIFT             (29U)
#define ETPU_TBCR_ENG1_TCR2CTL_WIDTH             (3U)
#define ETPU_TBCR_ENG1_TCR2CTL(x)                (((uint32_t)(((uint32_t)(x)) << ETPU_TBCR_ENG1_TCR2CTL_SHIFT)) & ETPU_TBCR_ENG1_TCR2CTL_MASK)
/*! @} */

/*! @name TB1R_ENG1 - eTPU Engine 1 Time Base 1 (TCR1) Visibility Register */
/*! @{ */

#define ETPU_TB1R_ENG1_TCR1_MASK                 (0xFFFFFFU)
#define ETPU_TB1R_ENG1_TCR1_SHIFT                (0U)
#define ETPU_TB1R_ENG1_TCR1_WIDTH                (24U)
#define ETPU_TB1R_ENG1_TCR1(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_TB1R_ENG1_TCR1_SHIFT)) & ETPU_TB1R_ENG1_TCR1_MASK)
/*! @} */

/*! @name TB2R_ENG1 - eTPU Engine 1 Time Base 2 (TCR2) Visibility Register */
/*! @{ */

#define ETPU_TB2R_ENG1_TCR2_MASK                 (0xFFFFFFU)
#define ETPU_TB2R_ENG1_TCR2_SHIFT                (0U)
#define ETPU_TB2R_ENG1_TCR2_WIDTH                (24U)
#define ETPU_TB2R_ENG1_TCR2(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_TB2R_ENG1_TCR2_SHIFT)) & ETPU_TB2R_ENG1_TCR2_MASK)
/*! @} */

/*! @name STAC_ENG1 - eTPU Engine 1 STAC Configuration Register */
/*! @{ */

#define ETPU_STAC_ENG1_SRV2_MASK                 (0xFU)
#define ETPU_STAC_ENG1_SRV2_SHIFT                (0U)
#define ETPU_STAC_ENG1_SRV2_WIDTH                (4U)
#define ETPU_STAC_ENG1_SRV2(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_STAC_ENG1_SRV2_SHIFT)) & ETPU_STAC_ENG1_SRV2_MASK)

#define ETPU_STAC_ENG1_SERVER_ID2_MASK           (0xF00U)
#define ETPU_STAC_ENG1_SERVER_ID2_SHIFT          (8U)
#define ETPU_STAC_ENG1_SERVER_ID2_WIDTH          (4U)
#define ETPU_STAC_ENG1_SERVER_ID2(x)             (((uint32_t)(((uint32_t)(x)) << ETPU_STAC_ENG1_SERVER_ID2_SHIFT)) & ETPU_STAC_ENG1_SERVER_ID2_MASK)

#define ETPU_STAC_ENG1_RSC2_MASK                 (0x4000U)
#define ETPU_STAC_ENG1_RSC2_SHIFT                (14U)
#define ETPU_STAC_ENG1_RSC2_WIDTH                (1U)
#define ETPU_STAC_ENG1_RSC2(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_STAC_ENG1_RSC2_SHIFT)) & ETPU_STAC_ENG1_RSC2_MASK)

#define ETPU_STAC_ENG1_REN2_MASK                 (0x8000U)
#define ETPU_STAC_ENG1_REN2_SHIFT                (15U)
#define ETPU_STAC_ENG1_REN2_WIDTH                (1U)
#define ETPU_STAC_ENG1_REN2(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_STAC_ENG1_REN2_SHIFT)) & ETPU_STAC_ENG1_REN2_MASK)

#define ETPU_STAC_ENG1_SRV1_MASK                 (0xF0000U)
#define ETPU_STAC_ENG1_SRV1_SHIFT                (16U)
#define ETPU_STAC_ENG1_SRV1_WIDTH                (4U)
#define ETPU_STAC_ENG1_SRV1(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_STAC_ENG1_SRV1_SHIFT)) & ETPU_STAC_ENG1_SRV1_MASK)

#define ETPU_STAC_ENG1_SERVER_ID1_MASK           (0xF000000U)
#define ETPU_STAC_ENG1_SERVER_ID1_SHIFT          (24U)
#define ETPU_STAC_ENG1_SERVER_ID1_WIDTH          (4U)
#define ETPU_STAC_ENG1_SERVER_ID1(x)             (((uint32_t)(((uint32_t)(x)) << ETPU_STAC_ENG1_SERVER_ID1_SHIFT)) & ETPU_STAC_ENG1_SERVER_ID1_MASK)

#define ETPU_STAC_ENG1_RSC1_MASK                 (0x40000000U)
#define ETPU_STAC_ENG1_RSC1_SHIFT                (30U)
#define ETPU_STAC_ENG1_RSC1_WIDTH                (1U)
#define ETPU_STAC_ENG1_RSC1(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_STAC_ENG1_RSC1_SHIFT)) & ETPU_STAC_ENG1_RSC1_MASK)

#define ETPU_STAC_ENG1_REN1_MASK                 (0x80000000U)
#define ETPU_STAC_ENG1_REN1_SHIFT                (31U)
#define ETPU_STAC_ENG1_REN1_WIDTH                (1U)
#define ETPU_STAC_ENG1_REN1(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_STAC_ENG1_REN1_SHIFT)) & ETPU_STAC_ENG1_REN1_MASK)
/*! @} */

/*! @name TBCR_ENG2 - eTPU Engine 2 Time Base Configuration Register */
/*! @{ */

#define ETPU_TBCR_ENG2_TCR1P_MASK                (0xFFU)
#define ETPU_TBCR_ENG2_TCR1P_SHIFT               (0U)
#define ETPU_TBCR_ENG2_TCR1P_WIDTH               (8U)
#define ETPU_TBCR_ENG2_TCR1P(x)                  (((uint32_t)(((uint32_t)(x)) << ETPU_TBCR_ENG2_TCR1P_SHIFT)) & ETPU_TBCR_ENG2_TCR1P_MASK)

#define ETPU_TBCR_ENG2_TCR1CS_MASK               (0x2000U)
#define ETPU_TBCR_ENG2_TCR1CS_SHIFT              (13U)
#define ETPU_TBCR_ENG2_TCR1CS_WIDTH              (1U)
#define ETPU_TBCR_ENG2_TCR1CS(x)                 (((uint32_t)(((uint32_t)(x)) << ETPU_TBCR_ENG2_TCR1CS_SHIFT)) & ETPU_TBCR_ENG2_TCR1CS_MASK)

#define ETPU_TBCR_ENG2_TCR1CTL_MASK              (0xC000U)
#define ETPU_TBCR_ENG2_TCR1CTL_SHIFT             (14U)
#define ETPU_TBCR_ENG2_TCR1CTL_WIDTH             (2U)
#define ETPU_TBCR_ENG2_TCR1CTL(x)                (((uint32_t)(((uint32_t)(x)) << ETPU_TBCR_ENG2_TCR1CTL_SHIFT)) & ETPU_TBCR_ENG2_TCR1CTL_MASK)

