zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_ETPU.h
#define ETPU_WDTR_ENG2_WDCNT_MASK                (0xFFFFU)
#define ETPU_WDTR_ENG2_WDCNT_SHIFT               (0U)
#define ETPU_WDTR_ENG2_WDCNT_WIDTH               (16U)
#define ETPU_WDTR_ENG2_WDCNT(x)                  (((uint32_t)(((uint32_t)(x)) << ETPU_WDTR_ENG2_WDCNT_SHIFT)) & ETPU_WDTR_ENG2_WDCNT_MASK)

#define ETPU_WDTR_ENG2_WMO_MASK                  (0x10000000U)
#define ETPU_WDTR_ENG2_WMO_SHIFT                 (28U)
#define ETPU_WDTR_ENG2_WMO_WIDTH                 (1U)
#define ETPU_WDTR_ENG2_WMO(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_WDTR_ENG2_WMO_SHIFT)) & ETPU_WDTR_ENG2_WMO_MASK)

#define ETPU_WDTR_ENG2_WDM_MASK                  (0xC0000000U)
#define ETPU_WDTR_ENG2_WDM_SHIFT                 (30U)
#define ETPU_WDTR_ENG2_WDM_WIDTH                 (2U)
#define ETPU_WDTR_ENG2_WDM(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_WDTR_ENG2_WDM_SHIFT)) & ETPU_WDTR_ENG2_WDM_MASK)
/*! @} */

/*! @name IDLER_ENG2 - eTPU Idle Register for Engine 2 */
/*! @{ */

#define ETPU_IDLER_ENG2_ICLR_MASK                (0x1U)
#define ETPU_IDLER_ENG2_ICLR_SHIFT               (0U)
#define ETPU_IDLER_ENG2_ICLR_WIDTH               (1U)
#define ETPU_IDLER_ENG2_ICLR(x)                  (((uint32_t)(((uint32_t)(x)) << ETPU_IDLER_ENG2_ICLR_SHIFT)) & ETPU_IDLER_ENG2_ICLR_MASK)

#define ETPU_IDLER_ENG2_IDLE_CNT_MASK            (0xFFFFFFFEU)
#define ETPU_IDLER_ENG2_IDLE_CNT_SHIFT           (1U)
#define ETPU_IDLER_ENG2_IDLE_CNT_WIDTH           (31U)
#define ETPU_IDLER_ENG2_IDLE_CNT(x)              (((uint32_t)(((uint32_t)(x)) << ETPU_IDLER_ENG2_IDLE_CNT_SHIFT)) & ETPU_IDLER_ENG2_IDLE_CNT_MASK)
/*! @} */

/*! @name MECR - eTPU Memory Error Control Register */
/*! @{ */

#define ETPU_MECR_CEDD_MASK                      (0x1U)
#define ETPU_MECR_CEDD_SHIFT                     (0U)
#define ETPU_MECR_CEDD_WIDTH                     (1U)
#define ETPU_MECR_CEDD(x)                        (((uint32_t)(((uint32_t)(x)) << ETPU_MECR_CEDD_SHIFT)) & ETPU_MECR_CEDD_MASK)

#define ETPU_MECR_CRDIS_MASK                     (0x2U)
#define ETPU_MECR_CRDIS_SHIFT                    (1U)
#define ETPU_MECR_CRDIS_WIDTH                    (1U)
#define ETPU_MECR_CRDIS(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_MECR_CRDIS_SHIFT)) & ETPU_MECR_CRDIS_MASK)

#define ETPU_MECR_CTEND_MASK                     (0x4U)
#define ETPU_MECR_CTEND_SHIFT                    (2U)
#define ETPU_MECR_CTEND_WIDTH                    (1U)
#define ETPU_MECR_CTEND(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_MECR_CTEND_SHIFT)) & ETPU_MECR_CTEND_MASK)

#define ETPU_MECR_CEIE_MASK                      (0x80U)
#define ETPU_MECR_CEIE_SHIFT                     (7U)
#define ETPU_MECR_CEIE_WIDTH                     (1U)
#define ETPU_MECR_CEIE(x)                        (((uint32_t)(((uint32_t)(x)) << ETPU_MECR_CEIE_SHIFT)) & ETPU_MECR_CEIE_MASK)

#define ETPU_MECR_DEDD_MASK                      (0x100U)
#define ETPU_MECR_DEDD_SHIFT                     (8U)
#define ETPU_MECR_DEDD_WIDTH                     (1U)
#define ETPU_MECR_DEDD(x)                        (((uint32_t)(((uint32_t)(x)) << ETPU_MECR_DEDD_SHIFT)) & ETPU_MECR_DEDD_MASK)

#define ETPU_MECR_DRDIS_MASK                     (0x200U)
#define ETPU_MECR_DRDIS_SHIFT                    (9U)
#define ETPU_MECR_DRDIS_WIDTH                    (1U)
#define ETPU_MECR_DRDIS(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_MECR_DRDIS_SHIFT)) & ETPU_MECR_DRDIS_MASK)

#define ETPU_MECR_DTEND_MASK                     (0x400U)
#define ETPU_MECR_DTEND_SHIFT                    (10U)
#define ETPU_MECR_DTEND_WIDTH                    (1U)
#define ETPU_MECR_DTEND(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_MECR_DTEND_SHIFT)) & ETPU_MECR_DTEND_MASK)

#define ETPU_MECR_MDEIE_MASK                     (0x4000U)
#define ETPU_MECR_MDEIE_SHIFT                    (14U)
#define ETPU_MECR_MDEIE_WIDTH                    (1U)
#define ETPU_MECR_MDEIE(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_MECR_MDEIE_SHIFT)) & ETPU_MECR_MDEIE_MASK)

#define ETPU_MECR_HDEIE_MASK                     (0x8000U)
#define ETPU_MECR_HDEIE_SHIFT                    (15U)
#define ETPU_MECR_HDEIE_WIDTH                    (1U)
#define ETPU_MECR_HDEIE(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_MECR_HDEIE_SHIFT)) & ETPU_MECR_HDEIE_MASK)

#define ETPU_MECR_MECIE_MASK                     (0x10000U)
#define ETPU_MECR_MECIE_SHIFT                    (16U)
#define ETPU_MECR_MECIE_WIDTH                    (1U)
#define ETPU_MECR_MECIE(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_MECR_MECIE_SHIFT)) & ETPU_MECR_MECIE_MASK)

#define ETPU_MECR_FME_MASK                       (0x80000000U)
#define ETPU_MECR_FME_SHIFT                      (31U)
#define ETPU_MECR_FME_WIDTH                      (1U)
#define ETPU_MECR_FME(x)                         (((uint32_t)(((uint32_t)(x)) << ETPU_MECR_FME_SHIFT)) & ETPU_MECR_FME_MASK)
/*! @} */

/*! @name DEIAR - eTPU Data Error Injection Address Register */
/*! @{ */

#define ETPU_DEIAR_INJ_ADDR_MASK                 (0x3FFCU)
#define ETPU_DEIAR_INJ_ADDR_SHIFT                (2U)
#define ETPU_DEIAR_INJ_ADDR_WIDTH                (12U)
#define ETPU_DEIAR_INJ_ADDR(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_DEIAR_INJ_ADDR_SHIFT)) & ETPU_DEIAR_INJ_ADDR_MASK)
/*! @} */

/*! @name DEIDPR - eTPU Data Error Injection Data Pattern Register */
/*! @{ */

#define ETPU_DEIDPR_DFLIP_MASK                   (0xFFFFFFFFU)
#define ETPU_DEIDPR_DFLIP_SHIFT                  (0U)
#define ETPU_DEIDPR_DFLIP_WIDTH                  (32U)
#define ETPU_DEIDPR_DFLIP(x)                     (((uint32_t)(((uint32_t)(x)) << ETPU_DEIDPR_DFLIP_SHIFT)) & ETPU_DEIDPR_DFLIP_MASK)
/*! @} */

/*! @name DEIPPR - eTPU Data Error Injection Parity Pattern Register */
/*! @{ */

#define ETPU_DEIPPR_PFLIP_4_0_MASK               (0x1FU)
#define ETPU_DEIPPR_PFLIP_4_0_SHIFT              (0U)
#define ETPU_DEIPPR_PFLIP_4_0_WIDTH              (5U)
#define ETPU_DEIPPR_PFLIP_4_0(x)                 (((uint32_t)(((uint32_t)(x)) << ETPU_DEIPPR_PFLIP_4_0_SHIFT)) & ETPU_DEIPPR_PFLIP_4_0_MASK)

#define ETPU_DEIPPR_PFLIP_9_5_MASK               (0x1F00U)
#define ETPU_DEIPPR_PFLIP_9_5_SHIFT              (8U)
#define ETPU_DEIPPR_PFLIP_9_5_WIDTH              (5U)
#define ETPU_DEIPPR_PFLIP_9_5(x)                 (((uint32_t)(((uint32_t)(x)) << ETPU_DEIPPR_PFLIP_9_5_SHIFT)) & ETPU_DEIPPR_PFLIP_9_5_MASK)

#define ETPU_DEIPPR_PFLIP_14_10_MASK             (0x1F0000U)
#define ETPU_DEIPPR_PFLIP_14_10_SHIFT            (16U)
#define ETPU_DEIPPR_PFLIP_14_10_WIDTH            (5U)
#define ETPU_DEIPPR_PFLIP_14_10(x)               (((uint32_t)(((uint32_t)(x)) << ETPU_DEIPPR_PFLIP_14_10_SHIFT)) & ETPU_DEIPPR_PFLIP_14_10_MASK)

#define ETPU_DEIPPR_PFLIP_19_15_MASK             (0x1F000000U)
#define ETPU_DEIPPR_PFLIP_19_15_SHIFT            (24U)
#define ETPU_DEIPPR_PFLIP_19_15_WIDTH            (5U)
#define ETPU_DEIPPR_PFLIP_19_15(x)               (((uint32_t)(((uint32_t)(x)) << ETPU_DEIPPR_PFLIP_19_15_SHIFT)) & ETPU_DEIPPR_PFLIP_19_15_MASK)
/*! @} */

