zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_ETPU.h
/*! @name DERAR - eTPU Data Error Report Address Register */
/*! @{ */

#define ETPU_DERAR_ERR_ADDR_MASK                 (0x3FFCU)
#define ETPU_DERAR_ERR_ADDR_SHIFT                (2U)
#define ETPU_DERAR_ERR_ADDR_WIDTH                (12U)
#define ETPU_DERAR_ERR_ADDR(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_DERAR_ERR_ADDR_SHIFT)) & ETPU_DERAR_ERR_ADDR_MASK)

#define ETPU_DERAR_ERR_CHANNEL_MASK              (0x1F000000U)
#define ETPU_DERAR_ERR_CHANNEL_SHIFT             (24U)
#define ETPU_DERAR_ERR_CHANNEL_WIDTH             (5U)
#define ETPU_DERAR_ERR_CHANNEL(x)                (((uint32_t)(((uint32_t)(x)) << ETPU_DERAR_ERR_CHANNEL_SHIFT)) & ETPU_DERAR_ERR_CHANNEL_MASK)

#define ETPU_DERAR_ERR_ACC_MASK                  (0xC0000000U)
#define ETPU_DERAR_ERR_ACC_SHIFT                 (30U)
#define ETPU_DERAR_ERR_ACC_WIDTH                 (2U)
#define ETPU_DERAR_ERR_ACC(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_DERAR_ERR_ACC_SHIFT)) & ETPU_DERAR_ERR_ACC_MASK)
/*! @} */

/*! @name DERDR - eTPU Data Error Report Data Register */
/*! @{ */

#define ETPU_DERDR_DATA_MASK                     (0xFFFFFFFFU)
#define ETPU_DERDR_DATA_SHIFT                    (0U)
#define ETPU_DERDR_DATA_WIDTH                    (32U)
#define ETPU_DERDR_DATA(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_DERDR_DATA_SHIFT)) & ETPU_DERDR_DATA_MASK)
/*! @} */

/*! @name DERSR - eTPU Data Error Report Syndrome Register */
/*! @{ */

#define ETPU_DERSR_SYND0_MASK                    (0x1FU)
#define ETPU_DERSR_SYND0_SHIFT                   (0U)
#define ETPU_DERSR_SYND0_WIDTH                   (5U)
#define ETPU_DERSR_SYND0(x)                      (((uint32_t)(((uint32_t)(x)) << ETPU_DERSR_SYND0_SHIFT)) & ETPU_DERSR_SYND0_MASK)

#define ETPU_DERSR_BE0_MASK                      (0x80U)
#define ETPU_DERSR_BE0_SHIFT                     (7U)
#define ETPU_DERSR_BE0_WIDTH                     (1U)
#define ETPU_DERSR_BE0(x)                        (((uint32_t)(((uint32_t)(x)) << ETPU_DERSR_BE0_SHIFT)) & ETPU_DERSR_BE0_MASK)

#define ETPU_DERSR_SYND1_MASK                    (0x1F00U)
#define ETPU_DERSR_SYND1_SHIFT                   (8U)
#define ETPU_DERSR_SYND1_WIDTH                   (5U)
#define ETPU_DERSR_SYND1(x)                      (((uint32_t)(((uint32_t)(x)) << ETPU_DERSR_SYND1_SHIFT)) & ETPU_DERSR_SYND1_MASK)

#define ETPU_DERSR_BE1_MASK                      (0x8000U)
#define ETPU_DERSR_BE1_SHIFT                     (15U)
#define ETPU_DERSR_BE1_WIDTH                     (1U)
#define ETPU_DERSR_BE1(x)                        (((uint32_t)(((uint32_t)(x)) << ETPU_DERSR_BE1_SHIFT)) & ETPU_DERSR_BE1_MASK)

#define ETPU_DERSR_SYND2_MASK                    (0x1F0000U)
#define ETPU_DERSR_SYND2_SHIFT                   (16U)
#define ETPU_DERSR_SYND2_WIDTH                   (5U)
#define ETPU_DERSR_SYND2(x)                      (((uint32_t)(((uint32_t)(x)) << ETPU_DERSR_SYND2_SHIFT)) & ETPU_DERSR_SYND2_MASK)

#define ETPU_DERSR_BE2_MASK                      (0x800000U)
#define ETPU_DERSR_BE2_SHIFT                     (23U)
#define ETPU_DERSR_BE2_WIDTH                     (1U)
#define ETPU_DERSR_BE2(x)                        (((uint32_t)(((uint32_t)(x)) << ETPU_DERSR_BE2_SHIFT)) & ETPU_DERSR_BE2_MASK)

#define ETPU_DERSR_SYND3_MASK                    (0x1F000000U)
#define ETPU_DERSR_SYND3_SHIFT                   (24U)
#define ETPU_DERSR_SYND3_WIDTH                   (5U)
#define ETPU_DERSR_SYND3(x)                      (((uint32_t)(((uint32_t)(x)) << ETPU_DERSR_SYND3_SHIFT)) & ETPU_DERSR_SYND3_MASK)

#define ETPU_DERSR_BE3_MASK                      (0x80000000U)
#define ETPU_DERSR_BE3_SHIFT                     (31U)
#define ETPU_DERSR_BE3_WIDTH                     (1U)
#define ETPU_DERSR_BE3(x)                        (((uint32_t)(((uint32_t)(x)) << ETPU_DERSR_BE3_SHIFT)) & ETPU_DERSR_BE3_MASK)
/*! @} */

/*! @name MESR - eTPU Memory Error Status Register */
/*! @{ */

#define ETPU_MESR_CNCOVR_MASK                    (0x1U)
#define ETPU_MESR_CNCOVR_SHIFT                   (0U)
#define ETPU_MESR_CNCOVR_WIDTH                   (1U)
#define ETPU_MESR_CNCOVR(x)                      (((uint32_t)(((uint32_t)(x)) << ETPU_MESR_CNCOVR_SHIFT)) & ETPU_MESR_CNCOVR_MASK)

#define ETPU_MESR_CNCERR_MASK                    (0x80U)
#define ETPU_MESR_CNCERR_SHIFT                   (7U)
#define ETPU_MESR_CNCERR_WIDTH                   (1U)
#define ETPU_MESR_CNCERR(x)                      (((uint32_t)(((uint32_t)(x)) << ETPU_MESR_CNCERR_SHIFT)) & ETPU_MESR_CNCERR_MASK)

#define ETPU_MESR_DNCOVR_MASK                    (0x100U)
#define ETPU_MESR_DNCOVR_SHIFT                   (8U)
#define ETPU_MESR_DNCOVR_WIDTH                   (1U)
#define ETPU_MESR_DNCOVR(x)                      (((uint32_t)(((uint32_t)(x)) << ETPU_MESR_DNCOVR_SHIFT)) & ETPU_MESR_DNCOVR_MASK)

#define ETPU_MESR_DNCERR_MASK                    (0x8000U)
#define ETPU_MESR_DNCERR_SHIFT                   (15U)
#define ETPU_MESR_DNCERR_WIDTH                   (1U)
#define ETPU_MESR_DNCERR(x)                      (((uint32_t)(((uint32_t)(x)) << ETPU_MESR_DNCERR_SHIFT)) & ETPU_MESR_DNCERR_MASK)

#define ETPU_MESR_CCOVR_MASK                     (0x10000U)
#define ETPU_MESR_CCOVR_SHIFT                    (16U)
#define ETPU_MESR_CCOVR_WIDTH                    (1U)
#define ETPU_MESR_CCOVR(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_MESR_CCOVR_SHIFT)) & ETPU_MESR_CCOVR_MASK)

#define ETPU_MESR_CCERR_MASK                     (0x800000U)
#define ETPU_MESR_CCERR_SHIFT                    (23U)
#define ETPU_MESR_CCERR_WIDTH                    (1U)
#define ETPU_MESR_CCERR(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_MESR_CCERR_SHIFT)) & ETPU_MESR_CCERR_MASK)

#define ETPU_MESR_DCOVR_MASK                     (0x1000000U)
#define ETPU_MESR_DCOVR_SHIFT                    (24U)
#define ETPU_MESR_DCOVR_WIDTH                    (1U)
#define ETPU_MESR_DCOVR(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_MESR_DCOVR_SHIFT)) & ETPU_MESR_DCOVR_MASK)

#define ETPU_MESR_DCERR_MASK                     (0x80000000U)
#define ETPU_MESR_DCERR_SHIFT                    (31U)
#define ETPU_MESR_DCERR_WIDTH                    (1U)
#define ETPU_MESR_DCERR(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_MESR_DCERR_SHIFT)) & ETPU_MESR_DCERR_MASK)
/*! @} */

