zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_ETPU.h
/*! @name CEIAR - eTPU Code Error Injection Address Register */
/*! @{ */

#define ETPU_CEIAR_INJ_ADDR_MASK                 (0xFFFCU)
#define ETPU_CEIAR_INJ_ADDR_SHIFT                (2U)
#define ETPU_CEIAR_INJ_ADDR_WIDTH                (14U)
#define ETPU_CEIAR_INJ_ADDR(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CEIAR_INJ_ADDR_SHIFT)) & ETPU_CEIAR_INJ_ADDR_MASK)
/*! @} */

/*! @name CEIDPR - eTPU Code Error Injection Data Pattern Register */
/*! @{ */

#define ETPU_CEIDPR_DFLIP_MASK                   (0xFFFFFFFFU)
#define ETPU_CEIDPR_DFLIP_SHIFT                  (0U)
#define ETPU_CEIDPR_DFLIP_WIDTH                  (32U)
#define ETPU_CEIDPR_DFLIP(x)                     (((uint32_t)(((uint32_t)(x)) << ETPU_CEIDPR_DFLIP_SHIFT)) & ETPU_CEIDPR_DFLIP_MASK)
/*! @} */

/*! @name CEIPPR - eTPU Code Error Injection Parity Pattern Register */
/*! @{ */

#define ETPU_CEIPPR_PFLIP_MASK                   (0x7FU)
#define ETPU_CEIPPR_PFLIP_SHIFT                  (0U)
#define ETPU_CEIPPR_PFLIP_WIDTH                  (7U)
#define ETPU_CEIPPR_PFLIP(x)                     (((uint32_t)(((uint32_t)(x)) << ETPU_CEIPPR_PFLIP_SHIFT)) & ETPU_CEIPPR_PFLIP_MASK)
/*! @} */

/*! @name CERAR - eTPU Code Error Report Address Register */
/*! @{ */

#define ETPU_CERAR_ERR_ADDR_MASK                 (0xFFFCU)
#define ETPU_CERAR_ERR_ADDR_SHIFT                (2U)
#define ETPU_CERAR_ERR_ADDR_WIDTH                (14U)
#define ETPU_CERAR_ERR_ADDR(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CERAR_ERR_ADDR_SHIFT)) & ETPU_CERAR_ERR_ADDR_MASK)

#define ETPU_CERAR_ERR_CHANNEL_MASK              (0x1F000000U)
#define ETPU_CERAR_ERR_CHANNEL_SHIFT             (24U)
#define ETPU_CERAR_ERR_CHANNEL_WIDTH             (5U)
#define ETPU_CERAR_ERR_CHANNEL(x)                (((uint32_t)(((uint32_t)(x)) << ETPU_CERAR_ERR_CHANNEL_SHIFT)) & ETPU_CERAR_ERR_CHANNEL_MASK)

#define ETPU_CERAR_ERR_ACC_MASK                  (0xC0000000U)
#define ETPU_CERAR_ERR_ACC_SHIFT                 (30U)
#define ETPU_CERAR_ERR_ACC_WIDTH                 (2U)
#define ETPU_CERAR_ERR_ACC(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CERAR_ERR_ACC_SHIFT)) & ETPU_CERAR_ERR_ACC_MASK)
/*! @} */

/*! @name CERDR - eTPU Code Error Report Data Register */
/*! @{ */

#define ETPU_CERDR_CODE_MASK                     (0xFFFFFFFFU)
#define ETPU_CERDR_CODE_SHIFT                    (0U)
#define ETPU_CERDR_CODE_WIDTH                    (32U)
#define ETPU_CERDR_CODE(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_CERDR_CODE_SHIFT)) & ETPU_CERDR_CODE_MASK)
/*! @} */

/*! @name CERSR - eTPU Code Error Report Syndrome Register */
/*! @{ */

#define ETPU_CERSR_SYND_MASK                     (0x7FU)
#define ETPU_CERSR_SYND_SHIFT                    (0U)
#define ETPU_CERSR_SYND_WIDTH                    (7U)
#define ETPU_CERSR_SYND(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_CERSR_SYND_SHIFT)) & ETPU_CERSR_SYND_MASK)
/*! @} */

/*! @name CEFR - eTPU Code Error Fix Register */
/*! @{ */

#define ETPU_CEFR_CFIX_ADDR_MASK                 (0xFFFCU)
#define ETPU_CEFR_CFIX_ADDR_SHIFT                (2U)
#define ETPU_CEFR_CFIX_ADDR_WIDTH                (14U)
#define ETPU_CEFR_CFIX_ADDR(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CEFR_CFIX_ADDR_SHIFT)) & ETPU_CEFR_CFIX_ADDR_MASK)

#define ETPU_CEFR_CFIXM_MASK                     (0xC0000000U)
#define ETPU_CEFR_CFIXM_SHIFT                    (30U)
#define ETPU_CEFR_CFIXM_WIDTH                    (2U)
#define ETPU_CEFR_CFIXM(x)                       (((uint32_t)(((uint32_t)(x)) << ETPU_CEFR_CFIXM_SHIFT)) & ETPU_CEFR_CFIXM_MASK)
/*! @} */

/*! @name CISR_ENG1 - eTPU Channel Interrupt Status Register for Engine 1 */
/*! @{ */

#define ETPU_CISR_ENG1_CISn_MASK                 (0xFFFFFFFFU)
#define ETPU_CISR_ENG1_CISn_SHIFT                (0U)
#define ETPU_CISR_ENG1_CISn_WIDTH                (32U)
#define ETPU_CISR_ENG1_CISn(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CISR_ENG1_CISn_SHIFT)) & ETPU_CISR_ENG1_CISn_MASK)
/*! @} */

/*! @name CISR_ENG2 - eTPU Channel Interrupt Status Register for Engine 2 */
/*! @{ */

#define ETPU_CISR_ENG2_CISn_MASK                 (0xFFFFFFFFU)
#define ETPU_CISR_ENG2_CISn_SHIFT                (0U)
#define ETPU_CISR_ENG2_CISn_WIDTH                (32U)
#define ETPU_CISR_ENG2_CISn(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CISR_ENG2_CISn_SHIFT)) & ETPU_CISR_ENG2_CISn_MASK)
/*! @} */

/*! @name CDTRSR_ENG1 - eTPU Channel Data Transfer Request Status Register for Engine 1 */
/*! @{ */

#define ETPU_CDTRSR_ENG1_DTRSn_MASK              (0xFFFFFFFFU)
#define ETPU_CDTRSR_ENG1_DTRSn_SHIFT             (0U)
#define ETPU_CDTRSR_ENG1_DTRSn_WIDTH             (32U)
#define ETPU_CDTRSR_ENG1_DTRSn(x)                (((uint32_t)(((uint32_t)(x)) << ETPU_CDTRSR_ENG1_DTRSn_SHIFT)) & ETPU_CDTRSR_ENG1_DTRSn_MASK)
/*! @} */

/*! @name CDTRSR_ENG2 - eTPU Channel Data Transfer Request Status Register for Engine 2 */
/*! @{ */

#define ETPU_CDTRSR_ENG2_DTRSn_MASK              (0xFFFFFFFFU)
#define ETPU_CDTRSR_ENG2_DTRSn_SHIFT             (0U)
#define ETPU_CDTRSR_ENG2_DTRSn_WIDTH             (32U)
#define ETPU_CDTRSR_ENG2_DTRSn(x)                (((uint32_t)(((uint32_t)(x)) << ETPU_CDTRSR_ENG2_DTRSn_SHIFT)) & ETPU_CDTRSR_ENG2_DTRSn_MASK)
/*! @} */

/*! @name CIOSR_ENG1 - eTPU Channel Interrupt Overflow Status Register for Engine 1 */
/*! @{ */

#define ETPU_CIOSR_ENG1_CIOSn_MASK               (0xFFFFFFFFU)
#define ETPU_CIOSR_ENG1_CIOSn_SHIFT              (0U)
#define ETPU_CIOSR_ENG1_CIOSn_WIDTH              (32U)
#define ETPU_CIOSR_ENG1_CIOSn(x)                 (((uint32_t)(((uint32_t)(x)) << ETPU_CIOSR_ENG1_CIOSn_SHIFT)) & ETPU_CIOSR_ENG1_CIOSn_MASK)
/*! @} */

/*! @name CIOSR_ENG2 - eTPU Channel Interrupt Overflow Status Register for Engine 2 */
/*! @{ */

#define ETPU_CIOSR_ENG2_CIOSn_MASK               (0xFFFFFFFFU)
#define ETPU_CIOSR_ENG2_CIOSn_SHIFT              (0U)
#define ETPU_CIOSR_ENG2_CIOSn_WIDTH              (32U)
#define ETPU_CIOSR_ENG2_CIOSn(x)                 (((uint32_t)(((uint32_t)(x)) << ETPU_CIOSR_ENG2_CIOSn_SHIFT)) & ETPU_CIOSR_ENG2_CIOSn_MASK)
/*! @} */

/*! @name CDTROSR_ENG1 - eTPU Channel Data Transfer Request Overflow Status Register for Engine 1 */
/*! @{ */

#define ETPU_CDTROSR_ENG1_DTROSn_MASK            (0xFFFFFFFFU)
#define ETPU_CDTROSR_ENG1_DTROSn_SHIFT           (0U)
#define ETPU_CDTROSR_ENG1_DTROSn_WIDTH           (32U)
#define ETPU_CDTROSR_ENG1_DTROSn(x)              (((uint32_t)(((uint32_t)(x)) << ETPU_CDTROSR_ENG1_DTROSn_SHIFT)) & ETPU_CDTROSR_ENG1_DTROSn_MASK)
/*! @} */

/*! @name CDTROSR_ENG2 - eTPU Channel Data Transfer Request Overflow Status Register for Engine 2 */
/*! @{ */

#define ETPU_CDTROSR_ENG2_DTROSn_MASK            (0xFFFFFFFFU)
#define ETPU_CDTROSR_ENG2_DTROSn_SHIFT           (0U)
#define ETPU_CDTROSR_ENG2_DTROSn_WIDTH           (32U)
#define ETPU_CDTROSR_ENG2_DTROSn(x)              (((uint32_t)(((uint32_t)(x)) << ETPU_CDTROSR_ENG2_DTROSn_SHIFT)) & ETPU_CDTROSR_ENG2_DTROSn_MASK)
/*! @} */

/*! @name CIER_ENG1 - eTPU Channel Interrupt Enable Register for Engine 1 */
/*! @{ */

