zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_ETPU.h
#define ETPU_CIER_ENG1_CIEn_MASK                 (0xFFFFFFFFU)
#define ETPU_CIER_ENG1_CIEn_SHIFT                (0U)
#define ETPU_CIER_ENG1_CIEn_WIDTH                (32U)
#define ETPU_CIER_ENG1_CIEn(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CIER_ENG1_CIEn_SHIFT)) & ETPU_CIER_ENG1_CIEn_MASK)
/*! @} */

/*! @name CIER_ENG2 - eTPU Channel Interrupt Enable Register for Engine 2 */
/*! @{ */

#define ETPU_CIER_ENG2_CIEn_MASK                 (0xFFFFFFFFU)
#define ETPU_CIER_ENG2_CIEn_SHIFT                (0U)
#define ETPU_CIER_ENG2_CIEn_WIDTH                (32U)
#define ETPU_CIER_ENG2_CIEn(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CIER_ENG2_CIEn_SHIFT)) & ETPU_CIER_ENG2_CIEn_MASK)
/*! @} */

/*! @name CDTRER_ENG1 - eTPU Channel Data Transfer Request Enable Register for Engine 1 */
/*! @{ */

#define ETPU_CDTRER_ENG1_DTREn_MASK              (0xFFFFFFFFU)
#define ETPU_CDTRER_ENG1_DTREn_SHIFT             (0U)
#define ETPU_CDTRER_ENG1_DTREn_WIDTH             (32U)
#define ETPU_CDTRER_ENG1_DTREn(x)                (((uint32_t)(((uint32_t)(x)) << ETPU_CDTRER_ENG1_DTREn_SHIFT)) & ETPU_CDTRER_ENG1_DTREn_MASK)
/*! @} */

/*! @name CDTRER_ENG2 - eTPU Channel Data Transfer Request Enable Register for Engine 2 */
/*! @{ */

#define ETPU_CDTRER_ENG2_DTREn_MASK              (0xFFFFFFFFU)
#define ETPU_CDTRER_ENG2_DTREn_SHIFT             (0U)
#define ETPU_CDTRER_ENG2_DTREn_WIDTH             (32U)
#define ETPU_CDTRER_ENG2_DTREn(x)                (((uint32_t)(((uint32_t)(x)) << ETPU_CDTRER_ENG2_DTREn_SHIFT)) & ETPU_CDTRER_ENG2_DTREn_MASK)
/*! @} */

/*! @name WDSR_ENG1 - eTPU Watchdog Status Register for Engine 1 */
/*! @{ */

#define ETPU_WDSR_ENG1_WDSn_MASK                 (0xFFFFFFFFU)
#define ETPU_WDSR_ENG1_WDSn_SHIFT                (0U)
#define ETPU_WDSR_ENG1_WDSn_WIDTH                (32U)
#define ETPU_WDSR_ENG1_WDSn(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_WDSR_ENG1_WDSn_SHIFT)) & ETPU_WDSR_ENG1_WDSn_MASK)
/*! @} */

/*! @name WDSR_ENG2 - eTPU Watchdog Status Register for Engine 2 */
/*! @{ */

#define ETPU_WDSR_ENG2_WDSn_MASK                 (0xFFFFFFFFU)
#define ETPU_WDSR_ENG2_WDSn_SHIFT                (0U)
#define ETPU_WDSR_ENG2_WDSn_WIDTH                (32U)
#define ETPU_WDSR_ENG2_WDSn(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_WDSR_ENG2_WDSn_SHIFT)) & ETPU_WDSR_ENG2_WDSn_MASK)
/*! @} */

/*! @name CPSSR_ENG1 - eTPU Channel Pending Service Status Register for Engine 1 */
/*! @{ */

#define ETPU_CPSSR_ENG1_SRn_MASK                 (0xFFFFFFFFU)
#define ETPU_CPSSR_ENG1_SRn_SHIFT                (0U)
#define ETPU_CPSSR_ENG1_SRn_WIDTH                (32U)
#define ETPU_CPSSR_ENG1_SRn(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CPSSR_ENG1_SRn_SHIFT)) & ETPU_CPSSR_ENG1_SRn_MASK)
/*! @} */

/*! @name CPSSR_ENG2 - eTPU Channel Pending Service Status Register for Engine 2 */
/*! @{ */

#define ETPU_CPSSR_ENG2_SRn_MASK                 (0xFFFFFFFFU)
#define ETPU_CPSSR_ENG2_SRn_SHIFT                (0U)
#define ETPU_CPSSR_ENG2_SRn_WIDTH                (32U)
#define ETPU_CPSSR_ENG2_SRn(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CPSSR_ENG2_SRn_SHIFT)) & ETPU_CPSSR_ENG2_SRn_MASK)
/*! @} */

/*! @name CSSR_ENG1 - eTPU Channel Service Status Register for Engine 1 */
/*! @{ */

#define ETPU_CSSR_ENG1_SSn_MASK                  (0xFFFFFFFFU)
#define ETPU_CSSR_ENG1_SSn_SHIFT                 (0U)
#define ETPU_CSSR_ENG1_SSn_WIDTH                 (32U)
#define ETPU_CSSR_ENG1_SSn(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CSSR_ENG1_SSn_SHIFT)) & ETPU_CSSR_ENG1_SSn_MASK)
/*! @} */

/*! @name CSSR_ENG2 - eTPU Channel Service Status Register for Engine 2 */
/*! @{ */

#define ETPU_CSSR_ENG2_SSn_MASK                  (0xFFFFFFFFU)
#define ETPU_CSSR_ENG2_SSn_SHIFT                 (0U)
#define ETPU_CSSR_ENG2_SSn_WIDTH                 (32U)
#define ETPU_CSSR_ENG2_SSn(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CSSR_ENG2_SSn_SHIFT)) & ETPU_CSSR_ENG2_SSn_MASK)
/*! @} */

/*! @name CCR_ENG1 - eTPU Channel n Configuration Register for Engine 1 */
/*! @{ */

#define ETPU_CCR_ENG1_CPBA_MASK                  (0x7FFU)
#define ETPU_CCR_ENG1_CPBA_SHIFT                 (0U)
#define ETPU_CCR_ENG1_CPBA_WIDTH                 (11U)
#define ETPU_CCR_ENG1_CPBA(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG1_CPBA_SHIFT)) & ETPU_CCR_ENG1_CPBA_MASK)

#define ETPU_CCR_ENG1_OPOL_MASK                  (0x4000U)
#define ETPU_CCR_ENG1_OPOL_SHIFT                 (14U)
#define ETPU_CCR_ENG1_OPOL_WIDTH                 (1U)
#define ETPU_CCR_ENG1_OPOL(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG1_OPOL_SHIFT)) & ETPU_CCR_ENG1_OPOL_MASK)

#define ETPU_CCR_ENG1_ODIS_MASK                  (0x8000U)
#define ETPU_CCR_ENG1_ODIS_SHIFT                 (15U)
#define ETPU_CCR_ENG1_ODIS_WIDTH                 (1U)
#define ETPU_CCR_ENG1_ODIS(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG1_ODIS_SHIFT)) & ETPU_CCR_ENG1_ODIS_MASK)

#define ETPU_CCR_ENG1_CFS_MASK                   (0x1F0000U)
#define ETPU_CCR_ENG1_CFS_SHIFT                  (16U)
#define ETPU_CCR_ENG1_CFS_WIDTH                  (5U)
#define ETPU_CCR_ENG1_CFS(x)                     (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG1_CFS_SHIFT)) & ETPU_CCR_ENG1_CFS_MASK)

#define ETPU_CCR_ENG1_ETCS_MASK                  (0x1000000U)
#define ETPU_CCR_ENG1_ETCS_SHIFT                 (24U)
#define ETPU_CCR_ENG1_ETCS_WIDTH                 (1U)
#define ETPU_CCR_ENG1_ETCS(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG1_ETCS_SHIFT)) & ETPU_CCR_ENG1_ETCS_MASK)

#define ETPU_CCR_ENG1_ETPD_MASK                  (0x2000000U)
#define ETPU_CCR_ENG1_ETPD_SHIFT                 (25U)
#define ETPU_CCR_ENG1_ETPD_WIDTH                 (1U)
#define ETPU_CCR_ENG1_ETPD(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG1_ETPD_SHIFT)) & ETPU_CCR_ENG1_ETPD_MASK)

#define ETPU_CCR_ENG1_SSMAE_MASK                 (0x4000000U)
#define ETPU_CCR_ENG1_SSMAE_SHIFT                (26U)
#define ETPU_CCR_ENG1_SSMAE_WIDTH                (1U)
#define ETPU_CCR_ENG1_SSMAE(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG1_SSMAE_SHIFT)) & ETPU_CCR_ENG1_SSMAE_MASK)

#define ETPU_CCR_ENG1_T4DIS_MASK                 (0x8000000U)
#define ETPU_CCR_ENG1_T4DIS_SHIFT                (27U)
#define ETPU_CCR_ENG1_T4DIS_WIDTH                (1U)
#define ETPU_CCR_ENG1_T4DIS(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG1_T4DIS_SHIFT)) & ETPU_CCR_ENG1_T4DIS_MASK)

#define ETPU_CCR_ENG1_CPR_MASK                   (0x30000000U)
#define ETPU_CCR_ENG1_CPR_SHIFT                  (28U)
#define ETPU_CCR_ENG1_CPR_WIDTH                  (2U)
#define ETPU_CCR_ENG1_CPR(x)                     (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG1_CPR_SHIFT)) & ETPU_CCR_ENG1_CPR_MASK)

#define ETPU_CCR_ENG1_DTRE_MASK                  (0x40000000U)
#define ETPU_CCR_ENG1_DTRE_SHIFT                 (30U)
#define ETPU_CCR_ENG1_DTRE_WIDTH                 (1U)
#define ETPU_CCR_ENG1_DTRE(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG1_DTRE_SHIFT)) & ETPU_CCR_ENG1_DTRE_MASK)

#define ETPU_CCR_ENG1_CIE_MASK                   (0x80000000U)
#define ETPU_CCR_ENG1_CIE_SHIFT                  (31U)
#define ETPU_CCR_ENG1_CIE_WIDTH                  (1U)
#define ETPU_CCR_ENG1_CIE(x)                     (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG1_CIE_SHIFT)) & ETPU_CCR_ENG1_CIE_MASK)
/*! @} */

/*! @name CSCR_ENG1 - eTPU Channel n Status Control Register for Engine 1 */
/*! @{ */

#define ETPU_CSCR_ENG1_FM_MASK                   (0x3U)
#define ETPU_CSCR_ENG1_FM_SHIFT                  (0U)
#define ETPU_CSCR_ENG1_FM_WIDTH                  (2U)
#define ETPU_CSCR_ENG1_FM(x)                     (((uint32_t)(((uint32_t)(x)) << ETPU_CSCR_ENG1_FM_SHIFT)) & ETPU_CSCR_ENG1_FM_MASK)

#define ETPU_CSCR_ENG1_OBE_MASK                  (0x2000U)
#define ETPU_CSCR_ENG1_OBE_SHIFT                 (13U)
#define ETPU_CSCR_ENG1_OBE_WIDTH                 (1U)
#define ETPU_CSCR_ENG1_OBE(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CSCR_ENG1_OBE_SHIFT)) & ETPU_CSCR_ENG1_OBE_MASK)

