zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_ETPU.h
#define ETPU_CSCR_ENG1_OPS_MASK                  (0x4000U)
#define ETPU_CSCR_ENG1_OPS_SHIFT                 (14U)
#define ETPU_CSCR_ENG1_OPS_WIDTH                 (1U)
#define ETPU_CSCR_ENG1_OPS(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CSCR_ENG1_OPS_SHIFT)) & ETPU_CSCR_ENG1_OPS_MASK)

#define ETPU_CSCR_ENG1_IPS_MASK                  (0x8000U)
#define ETPU_CSCR_ENG1_IPS_SHIFT                 (15U)
#define ETPU_CSCR_ENG1_IPS_WIDTH                 (1U)
#define ETPU_CSCR_ENG1_IPS(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CSCR_ENG1_IPS_SHIFT)) & ETPU_CSCR_ENG1_IPS_MASK)

#define ETPU_CSCR_ENG1_DTROS_MASK                (0x400000U)
#define ETPU_CSCR_ENG1_DTROS_SHIFT               (22U)
#define ETPU_CSCR_ENG1_DTROS_WIDTH               (1U)
#define ETPU_CSCR_ENG1_DTROS(x)                  (((uint32_t)(((uint32_t)(x)) << ETPU_CSCR_ENG1_DTROS_SHIFT)) & ETPU_CSCR_ENG1_DTROS_MASK)

#define ETPU_CSCR_ENG1_DTRS_MASK                 (0x800000U)
#define ETPU_CSCR_ENG1_DTRS_SHIFT                (23U)
#define ETPU_CSCR_ENG1_DTRS_WIDTH                (1U)
#define ETPU_CSCR_ENG1_DTRS(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CSCR_ENG1_DTRS_SHIFT)) & ETPU_CSCR_ENG1_DTRS_MASK)

#define ETPU_CSCR_ENG1_CIOS_MASK                 (0x40000000U)
#define ETPU_CSCR_ENG1_CIOS_SHIFT                (30U)
#define ETPU_CSCR_ENG1_CIOS_WIDTH                (1U)
#define ETPU_CSCR_ENG1_CIOS(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CSCR_ENG1_CIOS_SHIFT)) & ETPU_CSCR_ENG1_CIOS_MASK)

#define ETPU_CSCR_ENG1_CIS_MASK                  (0x80000000U)
#define ETPU_CSCR_ENG1_CIS_SHIFT                 (31U)
#define ETPU_CSCR_ENG1_CIS_WIDTH                 (1U)
#define ETPU_CSCR_ENG1_CIS(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CSCR_ENG1_CIS_SHIFT)) & ETPU_CSCR_ENG1_CIS_MASK)
/*! @} */

/*! @name CHSRR_ENG1 - eTPU Channel n Host Service Request Register for Engine 1 */
/*! @{ */

#define ETPU_CHSRR_ENG1_HSR_MASK                 (0x7U)
#define ETPU_CHSRR_ENG1_HSR_SHIFT                (0U)
#define ETPU_CHSRR_ENG1_HSR_WIDTH                (3U)
#define ETPU_CHSRR_ENG1_HSR(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CHSRR_ENG1_HSR_SHIFT)) & ETPU_CHSRR_ENG1_HSR_MASK)
/*! @} */

/*! @name CCR_ENG2 - eTPU Channel n Configuration Register for Engine 2 */
/*! @{ */

#define ETPU_CCR_ENG2_CPBA_MASK                  (0x7FFU)
#define ETPU_CCR_ENG2_CPBA_SHIFT                 (0U)
#define ETPU_CCR_ENG2_CPBA_WIDTH                 (11U)
#define ETPU_CCR_ENG2_CPBA(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG2_CPBA_SHIFT)) & ETPU_CCR_ENG2_CPBA_MASK)

#define ETPU_CCR_ENG2_OPOL_MASK                  (0x4000U)
#define ETPU_CCR_ENG2_OPOL_SHIFT                 (14U)
#define ETPU_CCR_ENG2_OPOL_WIDTH                 (1U)
#define ETPU_CCR_ENG2_OPOL(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG2_OPOL_SHIFT)) & ETPU_CCR_ENG2_OPOL_MASK)

#define ETPU_CCR_ENG2_ODIS_MASK                  (0x8000U)
#define ETPU_CCR_ENG2_ODIS_SHIFT                 (15U)
#define ETPU_CCR_ENG2_ODIS_WIDTH                 (1U)
#define ETPU_CCR_ENG2_ODIS(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG2_ODIS_SHIFT)) & ETPU_CCR_ENG2_ODIS_MASK)

#define ETPU_CCR_ENG2_CFS_MASK                   (0x1F0000U)
#define ETPU_CCR_ENG2_CFS_SHIFT                  (16U)
#define ETPU_CCR_ENG2_CFS_WIDTH                  (5U)
#define ETPU_CCR_ENG2_CFS(x)                     (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG2_CFS_SHIFT)) & ETPU_CCR_ENG2_CFS_MASK)

#define ETPU_CCR_ENG2_ETCS_MASK                  (0x1000000U)
#define ETPU_CCR_ENG2_ETCS_SHIFT                 (24U)
#define ETPU_CCR_ENG2_ETCS_WIDTH                 (1U)
#define ETPU_CCR_ENG2_ETCS(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG2_ETCS_SHIFT)) & ETPU_CCR_ENG2_ETCS_MASK)

#define ETPU_CCR_ENG2_ETPD_MASK                  (0x2000000U)
#define ETPU_CCR_ENG2_ETPD_SHIFT                 (25U)
#define ETPU_CCR_ENG2_ETPD_WIDTH                 (1U)
#define ETPU_CCR_ENG2_ETPD(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG2_ETPD_SHIFT)) & ETPU_CCR_ENG2_ETPD_MASK)

#define ETPU_CCR_ENG2_SSMAE_MASK                 (0x4000000U)
#define ETPU_CCR_ENG2_SSMAE_SHIFT                (26U)
#define ETPU_CCR_ENG2_SSMAE_WIDTH                (1U)
#define ETPU_CCR_ENG2_SSMAE(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG2_SSMAE_SHIFT)) & ETPU_CCR_ENG2_SSMAE_MASK)

#define ETPU_CCR_ENG2_T4DIS_MASK                 (0x8000000U)
#define ETPU_CCR_ENG2_T4DIS_SHIFT                (27U)
#define ETPU_CCR_ENG2_T4DIS_WIDTH                (1U)
#define ETPU_CCR_ENG2_T4DIS(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG2_T4DIS_SHIFT)) & ETPU_CCR_ENG2_T4DIS_MASK)

#define ETPU_CCR_ENG2_CPR_MASK                   (0x30000000U)
#define ETPU_CCR_ENG2_CPR_SHIFT                  (28U)
#define ETPU_CCR_ENG2_CPR_WIDTH                  (2U)
#define ETPU_CCR_ENG2_CPR(x)                     (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG2_CPR_SHIFT)) & ETPU_CCR_ENG2_CPR_MASK)

#define ETPU_CCR_ENG2_DTRE_MASK                  (0x40000000U)
#define ETPU_CCR_ENG2_DTRE_SHIFT                 (30U)
#define ETPU_CCR_ENG2_DTRE_WIDTH                 (1U)
#define ETPU_CCR_ENG2_DTRE(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG2_DTRE_SHIFT)) & ETPU_CCR_ENG2_DTRE_MASK)

#define ETPU_CCR_ENG2_CIE_MASK                   (0x80000000U)
#define ETPU_CCR_ENG2_CIE_SHIFT                  (31U)
#define ETPU_CCR_ENG2_CIE_WIDTH                  (1U)
#define ETPU_CCR_ENG2_CIE(x)                     (((uint32_t)(((uint32_t)(x)) << ETPU_CCR_ENG2_CIE_SHIFT)) & ETPU_CCR_ENG2_CIE_MASK)
/*! @} */

/*! @name CSCR_ENG2 - eTPU Channel n Status Control Register for Engine 2 */
/*! @{ */

#define ETPU_CSCR_ENG2_FM_MASK                   (0x3U)
#define ETPU_CSCR_ENG2_FM_SHIFT                  (0U)
#define ETPU_CSCR_ENG2_FM_WIDTH                  (2U)
#define ETPU_CSCR_ENG2_FM(x)                     (((uint32_t)(((uint32_t)(x)) << ETPU_CSCR_ENG2_FM_SHIFT)) & ETPU_CSCR_ENG2_FM_MASK)

#define ETPU_CSCR_ENG2_OBE_MASK                  (0x2000U)
#define ETPU_CSCR_ENG2_OBE_SHIFT                 (13U)
#define ETPU_CSCR_ENG2_OBE_WIDTH                 (1U)
#define ETPU_CSCR_ENG2_OBE(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CSCR_ENG2_OBE_SHIFT)) & ETPU_CSCR_ENG2_OBE_MASK)

