zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_ETPU.h
#define ETPU_CSCR_ENG2_OPS_MASK                  (0x4000U)
#define ETPU_CSCR_ENG2_OPS_SHIFT                 (14U)
#define ETPU_CSCR_ENG2_OPS_WIDTH                 (1U)
#define ETPU_CSCR_ENG2_OPS(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CSCR_ENG2_OPS_SHIFT)) & ETPU_CSCR_ENG2_OPS_MASK)

#define ETPU_CSCR_ENG2_IPS_MASK                  (0x8000U)
#define ETPU_CSCR_ENG2_IPS_SHIFT                 (15U)
#define ETPU_CSCR_ENG2_IPS_WIDTH                 (1U)
#define ETPU_CSCR_ENG2_IPS(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CSCR_ENG2_IPS_SHIFT)) & ETPU_CSCR_ENG2_IPS_MASK)

#define ETPU_CSCR_ENG2_DTROS_MASK                (0x400000U)
#define ETPU_CSCR_ENG2_DTROS_SHIFT               (22U)
#define ETPU_CSCR_ENG2_DTROS_WIDTH               (1U)
#define ETPU_CSCR_ENG2_DTROS(x)                  (((uint32_t)(((uint32_t)(x)) << ETPU_CSCR_ENG2_DTROS_SHIFT)) & ETPU_CSCR_ENG2_DTROS_MASK)

#define ETPU_CSCR_ENG2_DTRS_MASK                 (0x800000U)
#define ETPU_CSCR_ENG2_DTRS_SHIFT                (23U)
#define ETPU_CSCR_ENG2_DTRS_WIDTH                (1U)
#define ETPU_CSCR_ENG2_DTRS(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CSCR_ENG2_DTRS_SHIFT)) & ETPU_CSCR_ENG2_DTRS_MASK)

#define ETPU_CSCR_ENG2_CIOS_MASK                 (0x40000000U)
#define ETPU_CSCR_ENG2_CIOS_SHIFT                (30U)
#define ETPU_CSCR_ENG2_CIOS_WIDTH                (1U)
#define ETPU_CSCR_ENG2_CIOS(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CSCR_ENG2_CIOS_SHIFT)) & ETPU_CSCR_ENG2_CIOS_MASK)

#define ETPU_CSCR_ENG2_CIS_MASK                  (0x80000000U)
#define ETPU_CSCR_ENG2_CIS_SHIFT                 (31U)
#define ETPU_CSCR_ENG2_CIS_WIDTH                 (1U)
#define ETPU_CSCR_ENG2_CIS(x)                    (((uint32_t)(((uint32_t)(x)) << ETPU_CSCR_ENG2_CIS_SHIFT)) & ETPU_CSCR_ENG2_CIS_MASK)
/*! @} */

/*! @name CHSRR_ENG2 - eTPU Channel n Host Service Request Register for Engine 2 */
/*! @{ */

#define ETPU_CHSRR_ENG2_HSR_MASK                 (0x7U)
#define ETPU_CHSRR_ENG2_HSR_SHIFT                (0U)
#define ETPU_CHSRR_ENG2_HSR_WIDTH                (3U)
#define ETPU_CHSRR_ENG2_HSR(x)                   (((uint32_t)(((uint32_t)(x)) << ETPU_CHSRR_ENG2_HSR_SHIFT)) & ETPU_CHSRR_ENG2_HSR_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group ETPU_Register_Masks */

/*!
 * @}
 */ /* end of group ETPU_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K39_ETPU_H_) */
